IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
    if(encodedCapacity >= 32767)
    {
        return WLESS_SM_CAPACITY_MAX_WH;
    }
    if(encodedCapacity <= -32768)
    {
        return WLESS_SM_CAPACITY_MIN_WH;
    }

    num = (int64_t)encodedCapacity *
          (WLESS_SM_CAPACITY_MAX_WH - WLESS_SM_CAPACITY_THRESHOLD_WH);

    if(num >= 0)
    {
        num += 32767L / 2L;
    }
    else
    {
        num -= 32767L / 2L;
    }

    decoded = (int32_t)(num / 32767L) + WLESS_SM_CAPACITY_THRESHOLD_WH;
    return decoded;
}

static bool WLESS_SM_externalStopCommand(void)
{
    if(WLESS_SM_stopCommand != 0U)
    {
        WLESS_SM_stopCommand = 0U;
        return true;
    }

    return false;
}

static bool WLESS_SM_sourceIsEmpty(void)
{
    int32_t sourceEnergy;

    sourceEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded);

    return WLESS_SM_updateFilteredCondition(&WLESS_SM_sourceEmptyFilter,
            sourceEnergy <= WLESS_SM_CAPACITY_MIN_WH,
            sourceEnergy >= (WLESS_SM_CAPACITY_MIN_WH +
                             WLESS_SM_ENERGY_HYSTERESIS_WH),
            true);
}

static bool WLESS_SM_loadIsFull(void)
{
    int32_t loadEnergy;

    loadEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded);

    return WLESS_SM_updateFilteredCondition(&WLESS_SM_loadFullFilter,
            loadEnergy >= WLESS_SM_CAPACITY_MAX_WH,
            loadEnergy <= (WLESS_SM_CAPACITY_MAX_WH -
                           WLESS_SM_ENERGY_HYSTERESIS_WH),
            true);
}

static WLESS_SM_WptState WLESS_SM_runWptDecision(void)
{
#if WLESS_SM_BUILD_VEHICLE == 1
    int32_t loadEnergy;
    int32_t sourceEnergy;

    loadEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded);

    sourceEnergy = (WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE) ?
            WLESS_SM_decodeCapacityWh(WLESS_SM_localEnergyEncoded) :
            WLESS_SM_decodeCapacityWh(WLESS_SM_remoteEnergyEncoded);

    if(WLESS_SM_externalStopCommand() ||
       WLESS_SM_sourceIsEmpty() ||
       WLESS_SM_loadIsFull() ||
       WLESS_SM_updateFilteredCondition(&WLESS_SM_energyBalanceFilter,
          (loadEnergy > WLESS_SM_CAPACITY_THRESHOLD_WH) &&
          (sourceEnergy <= WLESS_SM_CAPACITY_THRESHOLD_WH),
          (loadEnergy <= (WLESS_SM_CAPACITY_THRESHOLD_WH -
                          WLESS_SM_ENERGY_HYSTERESIS_WH)) ||
          (sourceEnergy > (WLESS_SM_CAPACITY_THRESHOLD_WH +
                           WLESS_SM_ENERGY_HYSTERESIS_WH)),
          true))
    {
        WLESS_SM_wptState = WLESS_SM_WPT_STOP;
        return WLESS_SM_WPT_STOP;
    }
#else
    if(WLESS_SM_externalStopCommand())
    {
        WLESS_SM_wptState = WLESS_SM_WPT_STOP;
        return WLESS_SM_WPT_STOP;
    }
#endif

    WLESS_SM_wptState = WLESS_SM_WPT_RUN;
    return WLESS_SM_WPT_RUN;
}

#if WLESS_SM_POWER_CONTROL_ENABLE == 1
/*
 * Integrazione prospettica FSM -> controllo di potenza UniPD.
 *
 * IMPORTANTE:
 * - questo codice e' escluso dal firmware corrente finche'
 *   WLESS_SM_POWER_CONTROL_ENABLE resta a 0;
 * - intenzionalmente non sovrascrive riferimenti, clamp o parametri di rampa
 *   configurabili tramite UART;
 * - ogni TODO DI INTEGRAZIONE seguente deve essere riesaminato prima
 *   dell'abilitazione hardware.
 */
static void WLESS_SM_disableUnipdPowerPath(void)
{
    /*
     * Arrestare prima gli attuatori attivi, quindi azzerare lo stato
     * dell'integrazione. UNIPD_disableWptHfcActuator() forza anche un trip OST
     * sul PWM HFC.
     */
    UNIPD_bbcPowerOutputEnable = 0U;
    TTPLPFC_bbcDockTestEnable = 0;
    TTPLPFC_BBC_disable();
    UNIPD_disableWptHfcActuator();
    UNIPD_wptIntegrationEnable = 0U;
    UNIPD_resetControlStatesCommand = 1U;

    /*
     * TODO DI INTEGRAZIONE: validare se qui serva un comando attivo di scarica
     * del DCLINK. Attualmente OFF interrompe la conversione di potenza, ma non
     * garantisce la scarica controllata dei condensatori del DC-link.
     */
}

static void WLESS_SM_prepareUnipdBbcPath(void)
{
    /*
     * Il percorso di docking test ha precedenza nell'ISR sul percorso BBC
     * UniPD e deve quindi essere disabilitato prima di assegnare autorita' a UniPD.
     */
    TTPLPFC_bbcDockTestEnable = 0;
    TTPLPFC_bbcDockTestLegMode = TTPLPFC_BBC_DOCK_TEST_LEG_DISABLED;
    TTPLPFC_BBC_disable();

    UNIPD_disableWptHfcActuator();
    UNIPD_wptIntegrationEnable = 1U;
    UNIPD_resetControlStatesCommand = 1U;
    UNIPD_bbcPowerOutputEnable = 1U;

    /*
     * L'ISR seleziona BOOST o BUCK dall'ingresso UniPD tx_1_rx_0, derivato da
     * WLESS_SM_localRole. Non selezionare qui la modalita' hardware: deve
     * esistere una sola autorita' per la mappatura ruolo -> modalita' convertitore.
     *
     * TODO DI INTEGRAZIONE: definire la strategia di cancellazione dei fault
     * VDC/IL latched. Intenzionalmente non vengono cancellati in automatico
     * durante una transizione di stato.
     *
     * TODO DI INTEGRAZIONE: validare riferimenti, limiti di corrente, clamp del
     * duty e parametri di rampa prima di impostare UNIPD_bbcPowerOutputEnable.
     */
}

static void WLESS_SM_enableUnipdSourceHfc(void)
{
    /*
     * Riprodurre la preparazione automatica dell'attuatore HFC UniPD gia'
     * verificata, lasciando pero' il calcolo del phase-shift a
     * UNIPD_runTransferredPowerIntegration().
     */
    UNIPD_wptHfcActuatorFault = 0U;

    CLLLC_hfcReceiverTestDuty_pu = 0.5f;
    CLLLC_hfcReceiverTestPhaseShiftPrimLegs_pu = 0.5f;
    CLLLC_pwmPhaseShiftPrimLegsRef_pu = 0.5f;
    CLLLC_pwmPhaseShiftPrimLegs_pu = 0.5f;
    CLLLC_hfcReceiverTestMode =
            CLLLC_HFC_RECEIVER_TEST_MODE_FIXED_SAFE_PWM;
    CLLLC_hfcReceiverTestSyncEnable = 0U;
    CLLLC_hfcReceiverTestEnable = 1U;
    CLLLC_hfcReceiverTestRun = 1U;
    CLLLC_clearTrip = 1;
    UNIPD_wptHfcActuatorEnable = 1U;

