IDSspa/WLESS_CHG_F28003x/wless_sm/wless_sm.c
    /*
     * TODO DI INTEGRAZIONE: prima di abilitare questo percorso sull'hardware, validare:
     * - ruolo locale SOURCE, ruolo remoto LOAD e link radio;
     * - disponibilita'/validita' di ITANK_MOD locale e remoto;
     * - strategia della corrente sintetica SOURCE finche' il relativo canale
     *   fisico non e' validato;
     * - sequenza BOOST-ready e condizione minima del DCLINK;
     * - strategia di cancellazione del trip HFC.
     */
}
#endif

static void WLESS_SM_setPowerCommand(WLESS_SM_PowerCommand command)
{
    WLESS_SM_powerCommand = command;

#if WLESS_SM_POWER_CONTROL_ENABLE == 1
    if(command == WLESS_SM_POWER_CMD_OFF)
    {
        WLESS_SM_disableUnipdPowerPath();
    }
    else if(command == WLESS_SM_POWER_CMD_SOURCE_PRECHARGE)
    {
        /*
         * Precharge SOURCE: eseguire il percorso BBC UniPD in modalita' BOOST
         * mantenendo HFC in trip. La FSM richiedera' SOURCE_ON solo dopo il
         * raggiungimento della propria condizione VBUS-ready.
         */
        WLESS_SM_prepareUnipdBbcPath();
    }
    else if(command == WLESS_SM_POWER_CMD_SOURCE_ON)
    {
        /*
         * Mantenere attivo l'anello BOOST e aggiungere l'attuatore HFC
         * trasmittente. Non resettare qui il controllore BBC: ha gia'
         * raggiunto il punto operativo di precharge.
         */
        WLESS_SM_enableUnipdSourceHfc();
    }
    else if(command == WLESS_SM_POWER_CMD_LOAD_PRECHARGE)
    {
        /*
         * Precharge LOAD: UniPD seleziona BUCK in base al ruolo locale. Il ponte
         * HFC resta disabilitato poiche' il rectifier LOAD e' passivo.
         */
        WLESS_SM_prepareUnipdBbcPath();
    }
    else if(command == WLESS_SM_POWER_CMD_LOAD_ON)
    {
        /*
         * Mantenere attivi l'anello BUCK UniPD e il calcolo della potenza
         * trasferita. Sono stati abilitati da LOAD_PRECHARGE; non viene emesso
         * alcun comando attivo per il ponte ricevente.
         */
        UNIPD_disableWptHfcActuator();
    }
#endif
}

#if WLESS_SM_BUILD_VEHICLE == 0
static void WLESS_SM_resetLocalExchange(void)
{
    WLESS_SM_powerToLoad = 0;
    WLESS_SM_iCoilErr = 0;
    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
}
#endif

void WLESS_SM_init(void)
{
#if WLESS_SM_TICK_GPIO_TEST_ENABLE == 1
    GPIO_setPinConfig(GPIO_30_GPIO30);
    GPIO_setControllerCore(WLESS_SM_TICK_GPIO_PIN, GPIO_CORE_CPU1);
    GPIO_setPadConfig(WLESS_SM_TICK_GPIO_PIN, GPIO_PIN_TYPE_STD);
    GPIO_setDirectionMode(WLESS_SM_TICK_GPIO_PIN, GPIO_DIR_MODE_OUT);
    GPIO_writePin(WLESS_SM_TICK_GPIO_PIN, 0U);
#endif

    WLESS_SM_state = WLESS_SM_STATE_STANDBY;
    WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
    WLESS_SM_remoteRole = WLESS_SM_ROLE_NONE;
    WLESS_SM_localCtrlState = WLESS_SM_CTRL_IDLE;
    WLESS_SM_remoteCtrlState = WLESS_SM_CTRL_IDLE;
    WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
    WLESS_SM_remoteAbort = WLESS_SM_ABORT_DISABLED;
    WLESS_SM_radioLink = WLESS_SM_LINK_OK;
    WLESS_SM_opMode = WLESS_SM_MODE_AUTO;
    WLESS_SM_wptState = WLESS_SM_WPT_STOP;
    WLESS_SM_powerCommand = WLESS_SM_POWER_CMD_OFF;
    WLESS_SM_localEnergyEncoded = 0;
    WLESS_SM_remoteEnergyEncoded = 0;
    WLESS_SM_vBus_V = 0U;
    WLESS_SM_iBat_mA = 0U;
    WLESS_SM_iCoil_mA = 0U;
    WLESS_SM_powerToLoad = 0;
    WLESS_SM_remotePowerToLoad = 0;
    WLESS_SM_iCoilErr = 0;
    WLESS_SM_remoteICoilErr = 0;
    WLESS_SM_noAckCount = 0U;
    WLESS_SM_noAckMaxCount = 0U;
    WLESS_SM_initOkCommand = 0U;
    WLESS_SM_stopCommand = 0U;
    WLESS_SM_diagnosticMessagePending = 0U;
    WLESS_SM_operationMessagePending = 0U;
    WLESS_SM_statusUpdatePending = 1U;
    WLESS_SM_pendingTicks = 0U;
    WLESS_SM_pendingTicksMax = 0U;
    WLESS_SM_ticksDropped = 0U;
    WLESS_SM_sourceTickAccumulator = 0UL;
    WLESS_SM_tickCounter = 0UL;
    WLESS_SM_stateStepCounter = 0UL;
    WLESS_SM_resetFilter(&WLESS_SM_sourceEmptyFilter);
    WLESS_SM_resetFilter(&WLESS_SM_loadFullFilter);
    WLESS_SM_resetFilter(&WLESS_SM_energyBalanceFilter);
    WLESS_SM_resetFilter(&WLESS_SM_vBusFilter);
    WLESS_SM_resetFilter(&WLESS_SM_iBatFilter);
    WLESS_SM_resetFilter(&WLESS_SM_iCoilFilter);
    WLESS_SM_filterState = WLESS_SM_state;
    WLESS_SM_filterRole = WLESS_SM_localRole;
}

void WLESS_SM_onSourceTickIsr(void)
{
    WLESS_SM_sourceTickAccumulator += WLESS_SM_BASE_TICK_HZ;

    if(WLESS_SM_sourceTickAccumulator >= WLESS_SM_SOURCE_TICK_HZ)
    {
        WLESS_SM_sourceTickAccumulator -= WLESS_SM_SOURCE_TICK_HZ;

#if WLESS_SM_TICK_GPIO_TEST_ENABLE == 1
        GPIO_togglePin(WLESS_SM_TICK_GPIO_PIN);
#endif

        if(WLESS_SM_pendingTicks < WLESS_SM_PENDING_TICK_LIMIT)
        {
            WLESS_SM_pendingTicks++;

            if(WLESS_SM_pendingTicks > WLESS_SM_pendingTicksMax)
            {
                WLESS_SM_pendingTicksMax = WLESS_SM_pendingTicks;
            }
        }
        else
        {
            WLESS_SM_ticksDropped++;
        }
    }
}

void WLESS_SM_servicePendingTicks(void)
{
    while(WLESS_SM_pendingTicks != 0U)
    {
        WLESS_SM_pendingTicks--;
        WLESS_SM_runBackgroundTick();
    }
}

void WLESS_SM_runBackgroundTick(void)
{
#if WLESS_SM_BUILD_VEHICLE == 1
    bool operationStateActive;
#endif

    WLESS_SM_tickCounter++;

#if WLESS_SM_BUILD_VEHICLE == 1
    operationStateActive =
            (WLESS_SM_state == WLESS_SM_STATE_SOURCE_ON) ||
            (WLESS_SM_state == WLESS_SM_STATE_LOAD_ON) ||
            (WLESS_SM_state == WLESS_SM_STATE_PRECHARGE_LOAD) ||
            (WLESS_SM_state == WLESS_SM_STATE_DISCHARGE_SOURCE);

    if(operationStateActive &&
       ((WLESS_SM_tickCounter % WLESS_SM_OPERATION_TICKS) == 0UL))
    {
        WLESS_SM_operationMessagePending = 1U;
    }
#endif

    if((WLESS_SM_tickCounter % WLESS_SM_DIAGNOSTIC_TICKS) == 0UL)
    {
        WLESS_SM_diagnosticMessagePending = 1U;

#if WLESS_SM_BUILD_VEHICLE == 1
        if(!operationStateActive)
        {
            WLESS_SM_operationMessagePending = 1U;
        }
#else
        /* Azzerato dal driver esclusivamente dopo un payload valido. */
        if(WLESS_SM_noAckCount < 15U)
        {
            WLESS_SM_noAckCount++;
            if(WLESS_SM_noAckCount > WLESS_SM_noAckMaxCount)
            {
                WLESS_SM_noAckMaxCount = WLESS_SM_noAckCount;
            }
        }
#endif
    }
}

#if WLESS_SM_BUILD_VEHICLE == 1
static void WLESS_SM_runVehicleStandbyOnly(void)
{
    if(WLESS_SM_radioLinkKo())
    {
        WLESS_SM_localRole = WLESS_SM_ROLE_NONE;
        WLESS_SM_powerToLoad = 0;
        WLESS_SM_iCoilErr = 0;
        WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
        WLESS_SM_state = WLESS_SM_STATE_DISCOVERY;
    }
    else if(WLESS_SM_opMode == WLESS_SM_MODE_MANUAL)
    {
        if(WLESS_SM_localRole == WLESS_SM_ROLE_SOURCE)
        {
            WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
            WLESS_SM_powerToLoad = 0;
            WLESS_SM_iCoilErr = 0;
            WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
            WLESS_SM_state = WLESS_SM_STATE_INIT_SOURCE;
        }
        else if(WLESS_SM_localRole == WLESS_SM_ROLE_LOAD)
        {
            WLESS_SM_localCtrlState = WLESS_SM_CTRL_INIT;
            WLESS_SM_powerToLoad = 0;
            WLESS_SM_iCoilErr = 0;
            WLESS_SM_localAbort = WLESS_SM_ABORT_DISABLED;
            WLESS_SM_state = WLESS_SM_STATE_INIT_LOAD;
        }
    }
}

static void WLESS_SM_runVehicleStep(void)
{
    int32_t energyDifference;

